app/views/carts/_cart.html.erb

<% unless cart.line_items.empty? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 980190962]]